# GetNumberingSchema Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
NumberingSchema..::..GetNumberingSchema Method
NumberingSchema Class See Also
---
Returns an instance of the specified Numbering Schema in the given document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public static NumberingSchema GetNumberingSchema(
	Document document,
	NumberingSchemaType schemaType
)
```

Visual Basic
---
```text
Public Shared Function GetNumberingSchema ( _
	document As Document, _
	schemaType As NumberingSchemaType _
) As NumberingSchema
```

Visual C++
---
```text
public:
static NumberingSchema^ GetNumberingSchema(
	Document^ document,
	NumberingSchemaType^ schemaType
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document A document to get the numbering schema from.
schemaType
    Type: Autodesk.Revit.DB..::..NumberingSchemaType The type of a built-in schema to get.
# ### Return Value
Instance of the specified schema.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given schemaType has an invalid Id. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
NumberingSchema Class
Autodesk.Revit.DB Namespace